tap "homebrew/cask"
cask_args appdir: "/Applications"

tap "homebrew/cask-fonts"

brew "git"
brew "go"
brew "htop"
brew "node"
brew "python"
brew "starship"
brew "neovim"
brew "zsh"
brew "fzf"
brew "exa"
brew "jq"
brew "ripgrep"
brew "fd"
brew "kubectl"
brew "tfenv"
brew "gnupg"
brew "awscli"
brew "aws-vault"
brew "docker"
brew "docker-compose"
brew "colima"
brew "localstack"
brew "golangci-lint"
brew "pinentry-mac"
brew "k9s"
brew "diffutils" # golangci-lint fails on ventura without it
brew "lua-language-server"
brew "graphviz"

cask "iterm2"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
cask "karabiner-elements"
cask "font-jetbrains-mono"
cask "font-iosevka"
cask "font-fira-code"
cask "stats"
cask "spotify"
cask "keybase"
cask "goland"
cask "brave-browser"
cask "postman"
cask "protonvpn"
cask "calibre"
cask "libreoffice"
cask "garmin-express"
cask "malwarebytes"
cask "cyberduck"
