cask_args appdir: "/Applications"

brew "git"
brew "go"
brew "rust"
brew "htop"
brew "node"
brew "python"
brew "starship"
brew "neovim"
brew "zsh"
brew "fzf"
brew "eza"
brew "jq"
brew "ripgrep"
brew "fd"
brew "gnupg"
brew "docker"
brew "docker-compose"
brew "colima"
brew "golangci-lint"
brew "pinentry-mac"
brew "kubectl"
brew "k9s"
brew "diffutils" # golangci-lint fails on ventura without it
brew "lua-language-server"
brew "graphviz"
brew "csvlens"
brew "deno"

cask "iterm2"
cask "rectangle"
cask "visual-studio-code"
cask "karabiner-elements"
cask "font-jetbrains-mono"
cask "font-iosevka"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "stats"
cask "spotify"
cask "brave-browser"
cask "protonvpn"
cask "calibre"
# cask "libreoffice"
cask "garmin-express"
cask "zed"
cask "firefox@developer-edition"
cask "cursor"
cask "android-platform-tools"
cask "chromedriver"
cask "openmtp"
cask "ghostty"
