tap "homebrew/cask"
cask_args appdir: "/Applications"

tap "homebrew/cask-fonts"

brew "git"
brew "go"
brew "htop"
brew "node"
brew "python"
brew "starship"
brew "neovim"
brew "zsh"
brew "fzf"
brew "exa"
brew "jq"
brew "ripgrep"
brew "fd"
brew "kubectl@1.22"
brew "terraform@0.12"
brew "gnupg"
brew "awscli"
brew "aws-vault"
brew "docker"
brew "docker-compose"
brew "colima"
brew "localstack"
brew "golangci-lint"
brew "openapi-generator"
brew "pinentry-mac"

cask "iterm2"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
cask "karabiner-elements"
cask "font-jetbrains-mono"
cask "font-iosevka"
cask "stats"
cask "spotify"
cask "notion"
cask "kindle"
cask "discord"
cask "keybase"
cask "goland"
cask "firefox"
cask "brave-browser"
cask "postman"
cask "protonvpn"
